---
kind: property
id: P:Autodesk.Revit.DB.ValueParsingOptions.AllowedValues
source: html/19ceb6b8-757f-752d-79e1-160a7d488193.htm
---
# Autodesk.Revit.DB.ValueParsingOptions.AllowedValues Property

The allowable range of values to be parsed.

## Syntax (C#)
```csharp
public AllowedValues AllowedValues { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration